---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.CurveElementFilter
source: html/65db4e68-3743-07f9-f0df-e411631084d2.htm
---
# CurveElementFilter Members

Constructs a new instance of a filter to match specific types of curve elements.